{
  "_name_or_path": "prajjwal1/bert-small",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 512,
  "id2label": {
    "0": "O",
    "1": "B-zoomIn",
    "2": "I-zoomIn",
    "3": "B-zoomOut",
    "4": "I-zoomOut",
    "5": "B-panLeft",
    "6": "B-panRight",
    "7": "B-panUp",
    "8": "B-panDown",
    "9": "B-goTo",
    "10": "B-location",
    "11": "I-location",
    "12": "B-layer",
    "13": "I-layer"
  },
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "label2id": {
    "B-goTo": 9,
    "B-layer": 12,
    "B-location": 10,
    "B-panDown": 8,
    "B-panLeft": 5,
    "B-panRight": 6,
    "B-panUp": 7,
    "B-zoomIn": 1,
    "B-zoomOut": 3,
    "I-layer": 13,
    "I-location": 11,
    "I-zoomIn": 2,
    "I-zoomOut": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.42.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
